УТ_для_edt/src/Documents/смартУправлениеАкциями/смартУправлениеАкциями.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>смартУправлениеАкциями</name>
  <comment>//++ #Б4818 смарт: Шляпников 17.11.2025 / Создание механизма учета скидок и акций по оборудованию. </comment>
  <registerRecords>AccumulationRegister.смартОстаткиАкционныхТоваров</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>НазваниеАкции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаАкции</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияАкции</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦеныРозница</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.смартСтатусыАкций</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАкции</name>
    <type>
      <types>EnumRef.смартВидыАкций</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаРозница</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВалютаРозница</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаАкция</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВалютаАкция</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОборудованиеДемозала</name>
      <type>
        <types>CatalogRef.демоОборудованиеДляДемонстрации</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоТоваров</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Бонус</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БонусСумма</name>
      <comment>//++ #Б-7562 смарт: Фролов 29.07.2026 //Управление акциями. Добавить колонку Бонусы в руб. в документ Управление акциями</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Серии</name>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </resources>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Enums/смартСтатусыАкций/смартСтатусыАкций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартСтатусыАкций</name>
  <comment>//++ #Б4818 смарт: Шляпников 17.11.2025 / Создание механизма учета скидок и акций по оборудованию. </comment>
  <enumValues>
    <name>Подготавливается</name>
  </enumValues>
  <enumValues>
    <name>Действует</name>
  </enumValues>
  <enumValues>
    <name>Завершена</name>
    <comment>//++ #Б-7532 смарт: Фролов 20.07.2026 //Добавить статус &quot;Завершено&quot; в Управление акциями</comment>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/смартВидыАкций/смартВидыАкций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартВидыАкций</name>
  <comment>//++ #Б4818 смарт: Шляпников 17.11.2025 / Создание механизма учета скидок и акций по оборудованию. </comment>
  <enumValues>
    <name>ДемоЗал</name>
  </enumValues>
  <enumValues>
    <name>Уценка</name>
  </enumValues>
  <enumValues>
    <name>СпецЦена</name>
  </enumValues>
  <enumValues>
    <name>Распродажа</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/демоСтатусГотовностиОборудования/демоСтатусГотовностиОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>демоСтатусГотовностиОборудования</name>
  <enumValues>
    <name>Готов</name>
  </enumValues>
  <enumValues>
    <name>НеГотов</name>
  </enumValues>
  <enumValues>
    <name>Частично</name>
  </enumValues>
  <enumValues>
    <name>Списано</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Catalogs/ХарактеристикиНоменклатуры/ХарактеристикиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ХарактеристикиНоменклатуры</name>
  <owners>Catalog.ВидыНоменклатуры</owners>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Принципал</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМGTIN</name>
    <type>
      <types>DefinedType.GTIN</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>смартСрокГарантии</name>
    <comment>//++ #1944 смарт: Мосолов 26.07.2024 // Реализовать механизм предложения доп гарантии при покупке оборудования.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/Catalogs/СерииНоменклатуры/СерииНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СерииНоменклатуры</name>
  <attributes>
    <name>ГоденДо</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>DefinedType.НомерСерии</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКиЗГИСМ</name>
    <type>
      <types>DefinedType.НомерКиЗГИСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>RFIDTID</name>
    <type>
      <types>DefinedType.RFIDTID</types>
    </type>
  </attributes>
  <attributes>
    <name>RFIDUser</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RFIDEPC</name>
    <type>
      <types>DefinedType.RFIDEPC</types>
    </type>
  </attributes>
  <attributes>
    <name>EPCGTIN</name>
    <type>
      <types>DefinedType.GTIN</types>
    </type>
  </attributes>
  <attributes>
    <name>RFIDМеткаНеЧитаемая</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроизводства</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводительЕГАИС</name>
    <type>
      <types>CatalogRef.КлассификаторОрганизацийЕГАИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Справка2ЕГАИС</name>
    <type>
      <types>CatalogRef.Справки2ЕГАИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводительВЕТИС</name>
    <type>
      <types>CatalogRef.ПредприятияВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаписьСкладскогоЖурналаВЕТИС</name>
    <type>
      <types>CatalogRef.ЗаписиСкладскогоЖурналаВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПартииВЕТИС</name>
    <type>
      <types>DefinedType.СтрокаВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальнаяРозничнаяЦенаМОТП</name>
    <comment>Максимальная розничная цена (МОТП)</comment>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>смартСтатусПроверкиОборудования</name>
    <comment>++ #1250 Фролов 17.11.2022 //Проверенное оборудование. &quot;Запрет на отгрузку без проверки оборудования  #1143 &quot;</comment>
    <type>
      <types>EnumRef.смартСтатусыПроверкиОборудованияПоСерии</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>смартДанныеУпаковочногоЛиста</name>
    <comment>//++ #Б1140 смарт: Шляпников 02.09.2025 / Учет данных по упаковочным листам.</comment>
    <attributes>
      <name>ТипУпаковки</name>
      <type>
        <types>EnumRef.смартТипыУпаковокУпаковочногоЛиста</types>
      </type>
    </attributes>
    <attributes>
      <name>Длина</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ширина</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Высота</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Хрупкое</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/Documents/смартУправлениеАкциями/Forms/ФормаДокумента/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем КэшированныеЗначения;

&НаКлиенте
Перем ТекущиеДанныеИдентификатор;

&НаКлиенте
Перем ПараметрыДляЗаписи Экспорт;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);

	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ПриЧтенииСозданииНаСервере();
		
		Объект.Ответственный = Пользователи.АвторизованныйПользователь();
		Объект.Организация = Справочники.смартПредопределенныеЗначения.ОрганизацияБитрикс.Значение;
		Объект.Статус = Перечисления.смартСтатусыАкций.Подготавливается;
		Объект.ВидЦеныРозница = смартОбщегоНазначенияСКэш.ПолучитьЗначениеПредопределеннойНастройки("ВидЦеныРозничнаяRUB");
		
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборот.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ИнтеграцияС1СДокументооборотом

	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	РассчитатьДанныеПоДокументу();
	
	ЗаполнитьВспомогательныеДанныеПоСтрокам();

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// Обработчик механизма "ДатыЗапретаИзменения"
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
	ПриЧтенииСозданииНаСервере();
	
	СобытияФорм.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ЗаполнитьСлужебныеРеквизитыПоНоменклатуре();
	
	РассчитатьДанныеПоДокументу();
	
	ЗаполнитьВспомогательныеДанныеПоСтрокам();
	
	СобытияФорм.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НоменклатураКлиент.ОбновитьКешированныеЗначенияДляУчетаСерий(Элементы.Товары, КэшированныеЗначения, ПараметрыУказанияСерий);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)

	Перем ВыполняемаяОперация;
	
	// &ЗамерПроизводительности
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина,
		"Документ.смартУправлениеАкциями.ФормаДокумента.Событие.ОбработкаВыбора");
	
	//Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") И ВыбранноеЗначение.Свойство("ВыполняемаяОперация", ВыполняемаяОперация) Тогда

	//	Если ВРег(ВыполняемаяОперация) = ВРег("ПодборТоваровИзЗаказа") Тогда

	//		ОбработкаПодбораТоваровИзЗаказа(ВыбранноеЗначение.АдресВХранилище);

	//	КонецЕсли;

	Если ИсточникВыбора.ИмяФормы = "Обработка.ПодборТоваровВДокументПродажи.Форма.Форма" Тогда

		ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение);
		
	//ИначеЕсли ИсточникВыбора.ИмяФормы = "Справочник.ВидыЗапасов.Форма.ФормаВводаВидовЗапасов" Тогда	
	//	
	//	ПолучитьВидыЗапасовИзХранилища(ВыбранноеЗначение);
	//	
	ИначеЕсли НоменклатураКлиент.ЭтоУказаниеСерий(ИсточникВыбора) Тогда
		
		НоменклатураКлиент.ОбработатьУказаниеСерии(ЭтаФорма, ПараметрыУказанияСерий, ВыбранноеЗначение);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	СобытияФормКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНавигационнойСсылки(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СобытияФормКлиент.ОбработкаНавигационнойСсылки(ЭтотОбъект, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	ОповеститьОПроведенииДокумента(ПараметрыЗаписи);

	МодификацияКонфигурацииКлиентПереопределяемый.ПослеЗаписи(ЭтаФорма, ПараметрыЗаписи);
	
	ОбщегоНазначенияУТКлиент.ВыполнитьДействияПослеЗаписи(ЭтаФорма, Объект, ПараметрыЗаписи);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
		МодульПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	МодификацияКонфигурацииПереопределяемый.ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);

	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборот.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	//++ #Б-7562 смарт: Фролов 29.07.2026 //Управление акциями. Добавить колонку Бонусы в руб. в документ Управление акциями
	Для Каждого СтрТовары Из Объект.Товары Цикл
		
		НомПП = 1;
		
		Если СтрТовары.Бонус = 0 И СтрТовары.БонусСумма = 0 Тогда
			
			ОбщегоНазначенияКлиент.СообщитьПользователю("В строке " + НомПП + " не заполнен бонус!");
			Отказ = Истина;
			
		КонецЕсли;
		
		НомПП = НомПП + 1;
		
	КонецЦикла;
	
	Если Отказ Тогда
		Возврат;	
	КонецЕсли;
	//-- #Б-7562 смарт: Фролов 29.07.2026
	
	СобытияФормКлиент.ПередЗаписью(ЭтотОбъект, Отказ, ПараметрыЗаписи);

	Если НеВыполнятьПроверкуПередЗаписью Тогда
		НеВыполнятьПроверкуПередЗаписью = Ложь;
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияУТКлиент.ЗаписатьОбъектПриНеобходимости(ЭтотОбъект, ПараметрыЗаписи, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписьюОбработатьЗаписьОбъектаВФорме(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Нет Тогда
		
		ОбщегоНазначенияУТКлиент.ОбработатьЗаписьОбъектаВФорме(ЭтаФорма, ДополнительныеПараметры.ПараметрыЗаписи);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ДатаПриИзмененииСервер();
	
	ЗаполнитьДанныеПоСтрокам();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидЦеныРозницаПриИзменении(Элемент)
	
	ЗаполнитьДанныеПоСтрокам();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидАкцииПриИзменении(Элемент)
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)

	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	Действия = Новый Структура;
	Действия.Вставить("ПроверитьХарактеристикуПоВладельцу", ТекущаяСтрока.Характеристика);
	Действия.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
	Действия.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
	Действия.Вставить("ЗаполнитьПризнакВедетсяУчетПоГТД", Новый Структура("Номенклатура", "ВедетсяУчетПоГТД"));
	Действия.Вставить("ПроверитьСериюРассчитатьСтатус", Новый Структура("Склад, ПараметрыУказанияСерий", ТекущаяСтрока.Склад, ПараметрыУказанияСерий));
	
	Действия.Вставить("НоменклатураПриИзмененииПереопределяемый", Новый Структура("ИмяФормы, ИмяТабличнойЧасти",
		ЭтаФорма.ИмяФормы, "Товары"));

	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, Действия, КэшированныеЗначения);
	
	ТоварыНоменклатураПриИзмененииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыХарактеристикаПриИзменении(Элемент)
	
	ТоварыХарактеристикаПриИзмененииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	НоменклатураКлиент.ОбновитьКешированныеЗначенияДляУчетаСерий(Элемент, КэшированныеЗначения, ПараметрыУказанияСерий, Копирование);
	
	Если НоваяСтрока Тогда
		Элементы.Товары.ТекущиеДанные.Бонус = 1;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ТоварыПослеРедактированияНаСервере(Истина, Элементы.Товары.ТекущиеДанные.ПолучитьИдентификатор(), КэшированныеЗначения);
	НоменклатураКлиент.ОбновитьКешированныеЗначенияДляУчетаСерий(Элемент,КэшированныеЗначения, ПараметрыУказанияСерий);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередУдалением(Элемент, Отказ)
		
	НоменклатураКлиент.ОбновитьКешированныеЗначенияДляУчетаСерий(Элемент, КэшированныеЗначения, ПараметрыУказанияСерий);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПослеУдаления(Элемент)
	
	ОбновитьСтатусыСерий = НоменклатураКлиент.НеобходимоОбновитьСтатусыСерий(
		Элемент, КэшированныеЗначения, ПараметрыУказанияСерий, Истина);
	
	Если ОбновитьСтатусыСерий Тогда
		
		ТоварыПослеРедактированияНаСервере(ОбновитьСтатусыСерий, Неопределено, КэшированныеЗначения);
		НоменклатураКлиент.ОбновитьКешированныеЗначенияДляУчетаСерий(Элемент,КэшированныеЗначения,ПараметрыУказанияСерий);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСерияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьПодборСерий(Ложь, Элемент.ТекстРедактирования);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСерияПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	ВыбранноеЗначение = НоменклатураКлиентСервер.ВыбраннаяСерия();
	
	ВыбранноеЗначение.Значение            		 = ТекущаяСтрока.Серия;
	ВыбранноеЗначение.ИдентификаторТекущейСтроки = ТекущаяСтрока.ПолучитьИдентификатор();
	
	НоменклатураКлиент.ОбработатьУказаниеСерии(ЭтаФорма, ПараметрыУказанияСерий, ВыбранноеЗначение);
	
	ТоварыНоменклатураПриИзмененииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаАкцияПриИзменении(Элемент)
	
	ТоварыЦенаАкцияПриИзмененииСервер();
	
КонецПроцедуры

&НаСервере
Процедура ТоварыЦенаАкцияПриИзмененииСервер()
	
	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить(Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока));
	ЗаполнитьДанныеПоСтрокам(МассивСтрок);
	
КонецПроцедуры

&НаСервере
Процедура ТоварыНоменклатураПриИзмененииСервер()
	
	СтрокаТовара = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	Если СтрокаТовара.Номенклатура.ВидНоменклатуры <> Справочники.смартПредопределенныеЗначения.ВидНоменклатурыТоварПлоттерыСерии.Значение Тогда
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Нельзя добавлять номенклатуру другого вида кроме 'ТоварПлоттерыСерии'. Номенклатура %1 другого вида", СтрокаТовара.Номенклатура));
		СтрокаТовара.Номенклатура = Неопределено;
		Возврат;
	КонецЕсли;
	
	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить(СтрокаТовара);
	ЗаполнитьДанныеПоСтрокам(МассивСтрок);
	
КонецПроцедуры

&НаСервере
Процедура ТоварыХарактеристикаПриИзмененииСервер()
	
	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить(Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока));
	ЗаполнитьДанныеПоСтрокам(МассивСтрок);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкладПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	Действия = Новый Структура;
	Действия.Вставить("ПроверитьСериюРассчитатьСтатус", Новый Структура("Склад, ПараметрыУказанияСерий", ТекущаяСтрока.Склад, ПараметрыУказанияСерий));
	
	Действия.Вставить("НоменклатураПриИзмененииПереопределяемый", Новый Структура("ИмяФормы, ИмяТабличнойЧасти",
		ЭтаФорма.ИмяФормы, "Товары"));

	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, Действия, КэшированныеЗначения);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПроцентСкидкиПриИзменении(Элемент)
	
	Если Элементы.Товары.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	стрТовары = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	стрТовары.ЦенаАкция = стрТовары.ЦенаРозница * (1 - стрТовары.ПроцентСкидки / 100);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПровестиДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Провести(ЭтаФорма, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиИЗакрыть(Команда)
	
	ОбщегоНазначенияУТКлиент.ПровестиИЗакрыть(ЭтаФорма, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьТовары(Команда)
	
	// &ЗамерПроизводительности
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина,
		"Документ.смартУправлениеАкциями.ФормаДокумента.Команда.ПодобратьТовары");
	
	ПараметрыФормы = Новый Структура;
	//ПараметрыФормы.Вставить("Склад",                             Объект.Склад);
	ПараметрыФормы.Вставить("РежимПодбораБезСуммовыхПараметров", Истина);
	ПараметрыФормы.Вставить("СкрыватьКолонкуВидЦены",            Истина);
	ПараметрыФормы.Вставить("СкрыватьКомандуЦеныНоменклатуры",   Истина);
	ПараметрыФормы.Вставить("ОтборПоТипуНоменклатуры",           Новый ФиксированныйМассив(НоменклатураКлиентСервер.ОтборПоТоваруМногооборотнойТаре(Ложь)));
	ПараметрыФормы.Вставить("Заголовок",                         НСтр("ru = 'Подбор товаров'"));
	ПараметрыФормы.Вставить("Дата",                              Объект.Дата);
	ПараметрыФормы.Вставить("Документ",                          Объект.Ссылка);
	ПараметрыФормы.Вставить("ПараметрыУказанияСерий",            ПараметрыУказанияСерий);
	
	ОткрытьФорму("Обработка.ПодборТоваровВДокументПродажи.Форма", ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор);

КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Записать(ЭтаФорма, Истина);
	
КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтаФорма, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборПоОстаткамДИЦ(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОборудованиеВДокументе", ПолучитьМассивОборудованияВДокументе());
	ПараметрыФормы.Вставить("ВидЦены", Объект.ВидЦеныРозница);
	
	ОткрытьФорму("Документ.смартУправлениеАкциями.Форма.ФормаПодбораДИЦ", ПараметрыФормы, ЭтаФорма,,,, Новый ОписаниеОповещения("ПодборПоОстаткамДИЦЗавершение", ЭтаФорма));
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборПоОстаткамДИЦЗавершение(Значение, ДопПараметры) Экспорт
	
	Если НЕ Значение = Неопределено Тогда
		
		Если ЭтоАдресВременногоХранилища(Значение) Тогда
			ЗаполнитьПоДИЦСервер(Значение);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоДИЦСервер(Адрес)
	
	МассивСтрок = Новый Массив;
	ТЗ = ПолучитьИзВременногоХранилища(Адрес);
	
	Действия = Новый Структура;
	Действия.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
	Действия.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
	Действия.Вставить("ЗаполнитьПризнакВедетсяУчетПоГТД", Новый Структура("Номенклатура", "ВедетсяУчетПоГТД"));
	КэшированныеЗначения = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	
	Для каждого стрТЗ Из ТЗ Цикл
		
		НоваяСтрока = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, стрТЗ, "Номенклатура,Серия,Склад,ОборудованиеДемозала");
		НоваяСтрока.Бонус = 1;
		
		ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(НоваяСтрока, Действия, КэшированныеЗначения);
		
		МассивСтрок.Добавить(НоваяСтрока);
		
	КонецЦикла;
	
	ПодготовитьЗаполнитьУстановитьВидимостьСерий();
	
	ЗаполнитьДанныеПоСтрокам(МассивСтрок);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьДействияДляТоваров(Команда)
	
	ВыполнитьДействияДляТоваровСервер();
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьДействияДляТоваровСервер()
	
	Для каждого стрТовары Из Элементы.Товары.ВыделенныеСтроки Цикл
		
		ТекущаяСтрока = Объект.Товары.НайтиПоИдентификатору(стрТовары);
		
		Если УстановитьПроцентДляВыделенныхСтрок <> 0 Тогда
			
			ЦенаРозница = РаботаСКурсамиВалют.ПересчитатьВВалюту(ТекущаяСтрока.ЦенаРозница, ТекущаяСтрока.ВалютаРозница, ТекущаяСтрока.ВалютаАкция, Объект.Дата);
			ТекущаяСтрока.ЦенаАкция = ЦенаРозница * (1 - УстановитьПроцентДляВыделенныхСтрок / 100);
			
		КонецЕсли;
		
		Если РежимОкругления > 2 Тогда
			
			ТекЦена = ТекущаяСтрока.ЦенаАкция / pow(10, РежимОкругления - 2);
			ТекЦена = Окр(ТекЦена);
			ТекущаяСтрока.ЦенаАкция = ТекЦена * pow(10, РежимОкругления - 2);
			
		Иначе
			ТекущаяСтрока.ЦенаАкция = Окр(ТекущаяСтрока.ЦенаАкция, РежимОкругления);
		КонецЕсли;
		
		РассчитатьДанныеПоСтроке(ТекущаяСтрока);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьЦеныВВыделенныхСтрокахНаСервере()
	
	МассивСтрок = Новый Массив;
	
	Для каждого стрИД Из Элементы.Товары.ВыделенныеСтроки Цикл
		МассивСтрок.Добавить(Объект.Товары.НайтиПоИдентификатору(стрИД));
	КонецЦикла;
	
	Если МассивСтрок.Количество() > 0 Тогда
		ЗаполнитьДанныеПоСтрокам(МассивСтрок);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьЦеныВВыделенныхСтроках(Команда)
	ПерезаполнитьЦеныВВыделенныхСтрокахНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаАкцииПриИзменении(Элемент)
	
	ДатаПриИзмененииСервер();
	
	ЗаполнитьДанныеПоСтрокам();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();

	//

	НоменклатураСервер.УстановитьУсловноеОформлениеХарактеристикНоменклатуры(ЭтаФорма);

	//

	НоменклатураСервер.УстановитьУсловноеОформлениеСерийНоменклатуры(ЭтаФорма, "СерииПриПланированииОтгрузкиУказываютсяВТЧТовары");

	//

	НоменклатураСервер.УстановитьУсловноеОформлениеСтатусовУказанияСерий(ЭтаФорма, Ложь);

	// Создаем элемент условного оформления

	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();

	// Настраиваем отбор
	Отбор = ЭлементУсловногоОформления.Отбор;

	НовыйЭлементОтбора = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовыйЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.Серия");
	НовыйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	НовыйЭлементОтбора.Использование = Истина;

	// Настраиваем оформление
	Оформление = ЭлементУсловногоОформления.Оформление;
	Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	Оформление.УстановитьЗначениеПараметра("Текст", "1");

	// Устанавливаем применяемые поля (к каким полям таблицы применить оформление)
	ПолеОформления = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ТоварыКоличествоТоваров");
	ПолеОформления.Использование = Истина;
	
КонецПроцедуры

#Область ПриИзмененииРеквизитов

&НаСервере
Процедура ОрганизацияПриИзмененииСервер()
	
	
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииСервер()
	
	ПодготовитьЗаполнитьУстановитьВидимостьСерий();
	
КонецПроцедуры


&НаСервере
Процедура ТоварыПослеРедактированияНаСервере(ОбновитьСтатусыСерий, ИдентификаторСтроки, КэшированныеЗначения)
	
	Если ОбновитьСтатусыСерий Тогда
		ЗаполнитьСтатусыУказанияСерийПриОкончанииРедактированияСтрокиТЧ(ИдентификаторСтроки, КэшированныеЗначения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПодборыИОбработкаПроверкиКоличества

&НаСервере
Процедура ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение)

	ТаблицаТоваров = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресТоваровВХранилище);
	
	Действия = Новый Структура;
	Действия.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
	Действия.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
	Действия.Вставить("ЗаполнитьПризнакВедетсяУчетПоГТД", Новый Структура("Номенклатура", "ВедетсяУчетПоГТД"));
	КэшированныеЗначения = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	
	МассивСтрок = Новый Массив;
	
	Для каждого СтрокаТовара Из ТаблицаТоваров Цикл
		
		Если СтрокаТовара.Номенклатура.ВидНоменклатуры <> Справочники.смартПредопределенныеЗначения.ВидНоменклатурыТоварПлоттерыСерии.Значение Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Нельзя добавлять номенклатуру другого вида кроме 'ТоварПлоттерыСерии'. Номенклатура %1 другого вида", СтрокаТовара.Номенклатура));
			Продолжить;
		КонецЕсли;
		
		ТекущаяСтрока = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(ТекущаяСтрока, СтрокаТовара, "Номенклатура, Характеристика, ХарактеристикиИспользуются, Серия");
		ТекущаяСтрока.Бонус = 1;
		
		ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, Действия, КэшированныеЗначения);
		
		МассивСтрок.Добавить(ТекущаяСтрока);
	
	КонецЦикла;
	
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект, ПараметрыУказанияСерий);
	
	ЗаполнитьДанныеПоСтрокам(МассивСтрок);
	
КонецПроцедуры

#КонецОбласти

#Область Серии

&НаСервере
Функция ПараметрыФормыУказанияСерий(ТекущиеДанныеИдентификатор)
	
	Возврат НоменклатураСервер.ПараметрыФормыУказанияСерий(Объект, ПараметрыУказанияСерий, ТекущиеДанныеИдентификатор, ЭтаФорма);
	
КонецФункции

&НаСервере
Процедура ОбработатьУказаниеСерийСервер(ПараметрыФормыУказанияСерий)
	
	СтруктураДействий = Новый Структура;
	
	НоменклатураСервер.ОбработатьУказаниеСерий(Объект,ПараметрыУказанияСерий,ПараметрыФормыУказанияСерий,СтруктураДействий);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыСерий()
	
	Элементы.ТоварыСтатусУказанияСерий.Видимость   = ПараметрыУказанияСерий.ИспользоватьСерииНоменклатуры;
	Элементы.ТоварыСерия.Видимость                 = ПараметрыУказанияСерий.ИспользоватьСерииНоменклатуры;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтатусыУказанияСерийПриОкончанииРедактированияСтрокиТЧ(ТекущаяСтрокаИдентификатор, КэшированныеЗначения)

	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерийПриОкончанииРедактированияСтрокиТЧ(Объект, 
				ПараметрыУказанияСерий, ТекущаяСтрокаИдентификатор, КэшированныеЗначения);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПодборСерий(Текст = "", ТекущиеДанные = Неопределено)
	
	ТекущиеПараметрыУказанияСерий = ПараметрыУказанияСерий;
	СерияРедактируетсяВШапке      = Ложь;
	
	Если НоменклатураКлиент.ДляУказанияСерийНуженСерверныйВызов(ЭтаФорма, ТекущиеПараметрыУказанияСерий, Текст) Тогда
		
		Если ТекущиеДанные = Неопределено Тогда
			ТекущиеДанныеИдентификатор = Элементы.Товары.ТекущиеДанные.ПолучитьИдентификатор();
		Иначе
			ТекущиеДанныеИдентификатор = ТекущиеДанные.ПолучитьИдентификатор();
		КонецЕсли;
		ПараметрыФормыУказанияСерий = ПараметрыФормыУказанияСерий(ТекущиеДанныеИдентификатор);
		
		ЗначениеВозврата = Неопределено;

		
		ОткрытьФорму(ПараметрыФормыУказанияСерий.ИмяФормы,ПараметрыФормыУказанияСерий,ЭтаФорма,,,, Новый ОписаниеОповещения("ОткрытьПодборСерийЗавершение", ЭтотОбъект, Новый Структура("ПараметрыФормыУказанияСерий", ПараметрыФормыУказанияСерий)), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПодборСерийЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    ПараметрыФормыУказанияСерий = ДополнительныеПараметры.ПараметрыФормыУказанияСерий;
    
    ЗначениеВозврата = Результат;
    
    Если ЗначениеВозврата <> Неопределено Тогда
        ОбработатьУказаниеСерийСервер(ПараметрыФормыУказанияСерий);
	КонецЕсли;
	
    //НоменклатураКлиент.ОбновитьКешированныеЗначенияШапкиДляУчетаСерий(Объект, КэшированныеЗначения, ПараметрыУказанияСерий.Шапка);

КонецПроцедуры

&НаСервере
Процедура ПодготовитьЗаполнитьУстановитьВидимостьСерий()
	
	ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(НоменклатураСервер.ПараметрыУказанияСерий(Объект, Документы.смартУправлениеАкциями));
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект,ПараметрыУказанияСерий);
	НастроитьЭлементыСерий();
	
	КэшированныеЗначения = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	
	Для каждого стрТовары Из Объект.Товары Цикл
	
		Действия = Новый Структура;
		Действия.Вставить("ПроверитьСериюРассчитатьСтатус", Новый Структура("Склад, ПараметрыУказанияСерий", стрТовары.Склад, ПараметрыУказанияСерий));
		
		Действия.Вставить("НоменклатураПриИзмененииПереопределяемый", Новый Структура("ИмяФормы, ИмяТабличнойЧасти",
			ЭтаФорма.ИмяФормы, "Товары"));

		ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(стрТовары, Действия, КэшированныеЗначения);
		
	КонецЦикла;
	
КонецПроцедуры
	
#КонецОбласти

#Область Прочее

&НаКлиенте
Процедура Подключаемый_ЗакрытьФорму()
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОповеститьОПроведенииДокумента(ПараметрыЗаписи)

	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("РежимЗаписи",      ПараметрыЗаписи.РежимЗаписи);

	Оповестить("Запись_смартУправлениеАкциями", ПараметрыОповещения, Объект.Ссылка);

КонецПроцедуры

&НаСервере
Процедура УправлениеЭлементамиФормы()
	
	Элементы.ТоварыОборудованиеДемозала.Видимость = (Объект.ВидАкции = Перечисления.смартВидыАкций.ДемоЗал);
	Элементы.ТоварыГруппаДИЦ.Видимость = (Объект.ВидАкции = Перечисления.смартВидыАкций.ДемоЗал);
	Элементы.ТоварыКоличествоТоваров.Видимость = (Объект.ВидАкции = Перечисления.смартВидыАкций.Распродажа);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(НоменклатураСервер.ПараметрыУказанияСерий(Объект, Документы.смартУправлениеАкциями));
	
	ЗаполнитьСлужебныеРеквизитыПоНоменклатуре();
	
	УправлениеЭлементамиФормы();
	НастроитьЭлементыСерий();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСлужебныеРеквизитыПоНоменклатуре()
	
	ПараметрыЗаполненияРеквизитов = Новый Структура;
	ПараметрыЗаполненияРеквизитов.Вставить("ЗаполнитьПризнакХарактеристикиИспользуются",
											Новый Структура("Номенклатура", "ХарактеристикиИспользуются"));
	ПараметрыЗаполненияРеквизитов.Вставить("ЗаполнитьПризнакАртикул",
											Новый Структура("Номенклатура", "Артикул"));
	ПараметрыЗаполненияРеквизитов.Вставить("ЗаполнитьПризнакВедетсяУчетПоГТД",
											Новый Структура("Номенклатура", "ВедетсяУчетПоГТД"));
	ПараметрыЗаполненияРеквизитов.Вставить("ЗаполнитьПризнакТипНоменклатуры",
											Новый Структура("Номенклатура", "ТипНоменклатуры"));
	
	НоменклатураСервер.ЗаполнитьСлужебныеРеквизитыПоНоменклатуреВКоллекции(Объект.Товары,ПараметрыЗаполненияРеквизитов);
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСБуферомОбмена

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

&НаКлиенте
Процедура Подключаемый_ОбработатьЗаписьОбъекта()
	
	ОбщегоНазначенияУТКлиент.ОбработатьЗаписьОбъектаВФорме(ЭтотОбъект, ПараметрыДляЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьДанныеПоДокументу()

	Для каждого стрТовары Из Объект.Товары Цикл
		РассчитатьДанныеПоСтроке(стрТовары);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьДанныеПоСтроке(стрТовары)
	
	ЦенаРозница = РаботаСКурсамиВалют.ПересчитатьВВалюту(стрТовары.ЦенаРозница, стрТовары.ВалютаРозница, стрТовары.ВалютаАкция, Объект.Дата);
	стрТовары.ПроцентСкидки = ?(ЦенаРозница = 0, 0, (ЦенаРозница - стрТовары.ЦенаАкция) * 100 / ЦенаРозница);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПоСтрокам(ЗНАЧ МассивСтрок = Неопределено)
	
	ЗаполнитьВспомогательныеДанныеПоСтрокам(МассивСтрок);
	
	Если НЕ МассивСтрок = Неопределено Тогда
		
		МассивНоменклатуры = Новый Массив;
		МассивХарактеристик = Новый Массив;
		МассивХарактеристик.Добавить(Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
		
		Для каждого стрТовары Из МассивСтрок Цикл
			
			МассивНоменклатуры.Добавить(стрТовары.Номенклатура);
			
			Если ЗначениеЗаполнено(стрТовары.Характеристика) Тогда
				МассивХарактеристик.Добавить(стрТовары.Характеристика);
			КонецЕсли;
			
		КонецЦикла;
		
		Цены = ПолучитьЦеныНоменклатуры(МассивНоменклатуры, МассивХарактеристик);
		
	Иначе
		
		Цены = ПолучитьЦеныНоменклатуры();
		МассивСтрок = Объект.Товары;
		
	КонецЕсли;
	
	ВалютаРозница = Объект.ВидЦеныРозница.ВалютаЦены;
	ВалютаАкция = Объект.ВидЦеныРозница.ВалютаЦены;
	
	Для каждого стрТовары Из МассивСтрок Цикл
		
		стрТовары.ВалютаРозница = ВалютаРозница;
		стрТовары.ВалютаАкция = ВалютаАкция;
		
		строкиЦен = Цены.НайтиСтроки(Новый Структура("Номенклатура,Характеристика", стрТовары.Номенклатура, стрТовары.Характеристика));
		Если строкиЦен.Количество() > 0 Тогда
			стрТовары.ЦенаРозница = строкиЦен[0].Цена;
		Иначе
			стрТовары.ЦенаРозница = 0;
		КонецЕсли;
		
		РассчитатьДанныеПоСтроке(стрТовары);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВспомогательныеДанныеПоСтрокам(ЗНАЧ МассивСтрок = Неопределено)
	
	Если НЕ МассивСтрок = Неопределено Тогда
		
		МассивНоменклатуры = Новый Массив;
		МассивСкладов = Новый Массив;
		МассивСерий = Новый Массив;
		МассивСерий.Добавить(Справочники.СерииНоменклатуры.ПустаяСсылка());
		
		Для каждого стрТовары Из МассивСтрок Цикл
			
			МассивНоменклатуры.Добавить(стрТовары.Номенклатура);
			
			Если ЗначениеЗаполнено(стрТовары.Серия) Тогда
				МассивСерий.Добавить(стрТовары.Серия);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(стрТовары.Склад) Тогда
				МассивСкладов.Добавить(стрТовары.Склад);
			КонецЕсли;
			
		КонецЦикла;
		
		ДИЦ = ПолучитьДанныеДИЦ(МассивНоменклатуры, МассивСерий, МассивСкладов);
		
	Иначе
		
		ДИЦ = ПолучитьДанныеДИЦ();
		МассивСтрок = Объект.Товары;
		
	КонецЕсли;
	
	Для каждого стрТовары Из МассивСтрок Цикл
		
		Если ЗначениеЗаполнено(стрТовары.ОборудованиеДемозала) Тогда
			стрТовары.ЗапускВДИЦ = стрТовары.ОборудованиеДемозала.ДатаЗапуска;
			стрТовары.Пробег = стрТовары.ОборудованиеДемозала.ПробегОборудования;
			стрТовары.Заметки = стрТовары.ОборудованиеДемозала.ПромывкаИОстатки;
			стрТовары.ГодВыпуска = Формат(стрТовары.ОборудованиеДемозала.ГодВыпуска, "ДФ=гггг");
		Иначе
		
			строкиДИЦ = ДИЦ.НайтиСтроки(Новый Структура("Номенклатура,Серия,Склад", стрТовары.Номенклатура, стрТовары.Серия, стрТовары.Склад));
			Если строкиДИЦ.Количество() > 0 Тогда
				стрТовары.ЗапускВДИЦ = строкиДИЦ[0].ДатаЗапуска;
			Иначе
				стрТовары.ЗапускВДИЦ = Неопределено;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЦеныНоменклатуры(ЗНАЧ МассивНоменклатуры = Неопределено, ЗНАЧ МассивХарактеристик = Неопределено)
	
	Если МассивНоменклатуры = Неопределено Тогда
		МассивНоменклатуры = Объект.Товары.Выгрузить(, "Номенклатура").ВыгрузитьКолонку("Номенклатура");
	КонецЕсли;
	
	Если МассивХарактеристик = Неопределено Тогда
		МассивХарактеристик = Объект.Товары.Выгрузить(, "Характеристика").ВыгрузитьКолонку("Характеристика");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	|	ЦеныНоменклатурыСрезПоследних.Характеристика КАК Характеристика,
	|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			&Дата,
	|			Номенклатура В (&МассивНоменклатуры)
	|				И ВидЦены = &ВидЦены
	|				И Характеристика В (&МассивХарактеристик)) КАК ЦеныНоменклатурыСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", Объект.ДатаНачалаАкции);
	Запрос.УстановитьПараметр("ВидЦены", Объект.ВидЦеныРозница);
	Запрос.УстановитьПараметр("МассивНоменклатуры", МассивНоменклатуры);
	Запрос.УстановитьПараметр("МассивХарактеристик", МассивХарактеристик);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
Функция ПолучитьДанныеДИЦ(ЗНАЧ МассивНоменклатуры = Неопределено, ЗНАЧ МассивСерий = Неопределено, ЗНАЧ МассивСкладов = Неопределено)
	
	Если МассивНоменклатуры = Неопределено Тогда
		МассивНоменклатуры = Объект.Товары.Выгрузить(, "Номенклатура").ВыгрузитьКолонку("Номенклатура");
	КонецЕсли;
	
	Если МассивСерий = Неопределено Тогда
		МассивСерий = Объект.Товары.Выгрузить(, "Серия").ВыгрузитьКолонку("Серия");
	КонецЕсли;
	
	Если МассивСкладов = Неопределено Тогда
		МассивСкладов = Объект.Товары.Выгрузить(, "Склад").ВыгрузитьКолонку("Склад");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	демоОборудованиеДляДемонстрации.ДатаЗапуска КАК ДатаЗапуска,
	|	демоОборудованиеДляДемонстрации.Ссылка КАК Ссылка,
	|	демоОборудованиеДляДемонстрации.Номенклатура КАК Номенклатура,
	|	демоОборудованиеДляДемонстрации.Серия КАК Серия,
	|	демоОборудованиеДляДемонстрации.ДемоЗал КАК Склад
	|ИЗ
	|	Справочник.демоОборудованиеДляДемонстрации КАК демоОборудованиеДляДемонстрации
	|ГДЕ
	|	демоОборудованиеДляДемонстрации.Номенклатура В(&МассивНоменклатуры)
	|	И демоОборудованиеДляДемонстрации.Серия В(&МассивСерий)
	|	И демоОборудованиеДляДемонстрации.ДемоЗал В(&МассивСкладов)
	|	И демоОборудованиеДляДемонстрации.ГотовностьКДемонстрации = ЗНАЧЕНИЕ(Перечисление.демоСтатусГотовностиОборудования.Готов)";
	
	Запрос.УстановитьПараметр("МассивНоменклатуры", МассивНоменклатуры);
	Запрос.УстановитьПараметр("МассивСерий", МассивСерий);
	Запрос.УстановитьПараметр("МассивСкладов", МассивСкладов);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
Функция ПолучитьМассивОборудованияВДокументе()
	
	Возврат Объект.Товары.Выгрузить(, "ОборудованиеДемозала").ВыгрузитьКолонку("ОборудованиеДемозала");
	
КонецФункции

&НаКлиенте
//++ #Б-7562 смарт: Фролов 29.07.2026 //Управление акциями. Добавить колонку Бонусы в руб. в документ Управление акциями
Процедура ТоварыБонусПриИзменении(Элемент)

	Элементы.Товары.ТекущиеДанные.БонусСумма = 0;

КонецПроцедуры //-- #Б-7562 смарт: Фролов 29.07.2026

&НаКлиенте
//++ #Б-7562 смарт: Фролов 29.07.2026 //Управление акциями. Добавить колонку Бонусы в руб. в документ Управление акциями
Процедура ТоварыБонусСуммаПриИзменении(Элемент)

	Элементы.Товары.ТекущиеДанные.Бонус = 0;	
	
КонецПроцедуры //-- #Б-7562 смарт: Фролов 29.07.2026

#КонецОбласти
